Repository: mozilla-l10n/mt-training-data
Catalog: hus/hus_pontoon.tmx
Source language: en_us
Languages: hus

source: Create a { -firefox } Account or sign in
hus: Ka ts'ejka' jún a it k'al (cuenta) { -firefox } o kit otsits max a kwa'alits jún.

source: { $days }d { $hours }h { $minutes }m
hus: { $days } k'icháj { $hours } hora { $minutes } minuto

source: Decrypting…
hus: K'wajat i exal ki wila'...

source: Delete
hus: Ka pakuw

source: Download complete
hus: Tala' pa'iyits

source: Download files
hus: Ka pa'ba' an t'ojláb

source: Download { -firefox }
hus: Ka pa'ba' { -firefox }

source: Downloading
hus: K'wajat ti pa'íl

source: Download “{ $name }” with { -send-brand }: simple, safe file sharing
hus: Ka pa'ba' “{ $name }” k'al { -send-brand }: ka abna' a t'ojlabil, yab k'ibat ani k'anidh

source: Drag and drop files
hus: Ka kina' a t'ojlabil ani ka walka' te'

source: Encrypting…
hus: K'wajat i tsinat dheyál...

source: Enter your email
hus: Ka punuw a abnax dhuchlab Correo Electrónico.

source: Expires after { $downloadCount } or { $timespan }
hus: Ne'ets ka taliy ti { $downloadCount } o ti { $timespan }

source: Feedback
hus: Ka olna' max jant'oj yab u t'ojnal alwa'

source: Firefox Send requires JavaScript
hus: Firefox Send in yejenchal JavaScript

source: Importing…
hus: k'wajat i chiyál...

source: Incorrect password. Try again.
hus: Yab ja' an tsinat japixtaláb. Ka exa' junil.

source: Keep links active for up to { $count } days
hus: Ka ko'oy an enlace ma 1 a k'icháj Ka ko'oy an enlacechik ma { $count } a k'icháhchik

source: Learn about other { -mozilla } services
hus: Ka exla' jant'oj ti pidhál { -mozilla }

source: Learn more.
hus: Ka ajiy más.

source: Legal
hus: Axi walkadh ka t'ajan

source: Link expired
hus: Yabats u awil ki ela'

source: Manage shared files from any device
hus: Ka ejtow tit t'ojnal k'al t'ojlabil al jawakitsk'ij tum eyendhabnél

source: Maximum password length: { $length }
hus: In puwél an tsinat japixtaláb pel: { $length }

source: { $num } days
hus: 1 k'icháj { $num } k'ichajchik

source: { $num } downloads
hus: 1 pa'badh { $num } pa'badh

source: { $num } files
hus: 1 t'ojláb { $num } t'ojlabchik

source: { $num } hours
hus: 1 hora { $num } hora

source: { $num } minutes
hus: 1 minuto { $num }

source: { $num } weeks
hus: 1 semana { $num } i semanachik

source: Only { $count } archives are allowed.
hus: Expidh u awil 1 i t'ojláb. Expidh u awil { $count } i t'ojláb.

source: Only { $count } files can be uploaded at a time.
hus: Expidh u awil ka k'adhba' 1 i t'ojláb Expidh u awil ka k'adhba' { $count } i t'ojláb.

source: or click to send up to { $size }
hus: o ka t'aja' an clic abal ka abna' ma { $size }

source: ({ $partialSize } of { $totalSize })
hus: { $partialSize } xi ti { $totalSize }

source: Please enable JavaScript and try again.
hus: Ka lek'wtsiy JavaScript ani ka exa' junil.

source: Protect with password
hus: Ka k'aniy k'al jún i tsinat japixtaláb

source: Select files to upload
hus: Ka takuy an t'ojláb axi ne'ets ka k'adhba'

source: { -send-brand } lets you share files with end-to-end encryption and a link that automatically expires. So you can keep what you share private and make sure your stuff doesn’t stay online forever.
hus: { -send-brand } in t'ajál abal ka buk'uw a t'ojlabil po axé' tsinat abal an atikláb axi tat yab a le' kin tsu'uw yab kin ejtow, aniyej an enlace abal ka pa'ba' an t'ojláb u talél kwetém. Antsan patal axi ka abna' u awil ka buk'uw tsinat ani antsan jayej axi ka buk'uw yab u jilk'onal ets'ey ti ébtsolom (internet).

source: { -send-brand } will not work with this browser. { -send-short-brand } works best with the latest version of { -firefox }, and will work with the current version of most browsers.
hus: { -send-brand } yab u t'ojnal al axi navegador. { -send-short-brand } u t'ojnal alwa' k'al an { -firefox } axi it, ani ne'ets ka t'ojon alwa' k'al an it navegadorchik.

source: { -send-short-brand } is brought to you by the all-new { -firefox }.
hus: An it { -firefox } ti pidhál { -send-short-brand }

source: { -send-short-brand } Privacy Notice
hus: Tin kwentaj an "Tsinaxtaláb a k'al" { -send-short-brand }

source: Share files up to { $size }
hus: Ka buk'uw a t'ojlabil, ma { $size }

source: Share files with more people
hus: Ka buk'uw a t'ojlabil k'al pil i atiklabchik

source: Share the link to your file:
hus: Ka abna' an enlace al an eyendhanél:

source: Sign in to send up to { $size }
hus: Kit otsits abal ka ejtow ka abna' ma { $size }

source: Sign out
hus: Kit kalej

source: Simple, private file sharing
hus: Yab k'ibat, a tsinat t'ojlabil u awil ka buk'uw

source: Something went wrong!
hus: ¡Yab kalej alwa'!

source: That file is too big to upload. It should be less than { $size }
hus: Tekedh pulik axi a le' ka kadh'ba', kwa'al kin alemna' { $size }

source: There is a way to protect your privacy. Join Firefox.
hus: U awil ka k'aniy axi tat a k'al. Kit tamkun k'al Firefox.

source: This browser might not be able to decrypt a file this big.
hus: Walám axi navegador yab ne'ets kin ejtow kin japiy jún i t'ojláb tekedh pulik.

source: This file was shared via { -send-brand } with end-to-end encryption and a link that automatically expires.
hus: Axi t'ojláb aban k'al in tolmixtal an { -send-brand } ani tsinat, aniyej in tsap an enlace u talél kwetém.

source: This link has expired.
hus: An enlace talíts in tsap.

source: This password could not be set
hus: Axi tsinat japixtaláb yab u awil ka eyendha'

source: Total size: { $size }
hus: In puwél an t'ojláb: { $size }

source: Try Firefox Send
hus: Ka eyendha' Firefox Send

source: Try our favorite browser
hus: Ka eyendha' i navegador

source: Try { -send-brand } for simple, safe file sharing.
hus: Ka eyendha' { -send-brand } abal ka abna' a t'ojlabil, yab k'ibat ani k'anidh.

source: Unfortunately this version of Firefox does not support the web technology that powers Firefox Send. You’ll need to update your browser.
hus: Yab u awil ka eyendha' Firefox Send kom an NAVEGADOR Firefox biyalits. Ka Pa'ba' axi it.

source: Unlock
hus: Ka japiy

source: Update Firefox
hus: Ka itmedha' Firefox

source: Upload
hus: Ka k'adhba'

source: Version 1.0, dated March 12, 2019
hus: Versión 1.0 ani t'ajadh ti Marzo 12 ti tamub 2019.

source: Why does Firefox Send require JavaScript?
hus: ¿Jale' Firefox Send in yejenchal JavaScript?

source: Why is my browser not supported?
hus: ¿Jale' ti u NAVEGADOR yab in japiyal?

source: Your browser is not supported.
hus: Yab u awil ka japiyat k'al axi NAVEGADOR

source: Your file is encrypted and ready to send
hus: A t'ojlabil xo' tsinadhits ani u awilits ka abna'
